
def area(a):
    '''
    Принимает число a, возвращает квадрат этого числа.

        Параметры:
            a (int): десятичное число
        Возвращаемое значение:
            a * a (int): десятичное число, результат перемножения
    '''
    return a * a


def perimeter(a):
    '''
    Возращает периметр квадрата в десятичном виде.

        Параметры:
            a (int): десятичное число
        Возвращаемое значение:
            4 * a (int): десятичное число, сумма четырёх сторон
    '''
    return 4 * a
